; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v12 ?v13)
             (pred_4 ?v10 ?v4)
             (pred_12 ?v12 ?v4)
             (pred_1 ?v9 ?v12 )
	     (pred_11 ?v12)
             (pred_7 ?v1)
             (pred_6 ?v10)
             (pred_9 ?v4)
             (pred_5 ?v12)
             (pred_8 ?v10)
             (pred_10 ?v12)
             (pred_2 ))



(:action op_1
:parameters (?v5 ?v11 ?v7 ?v2)
:precondition (and (pred_7 ?v5) (pred_7 ?v11) (pred_6 ?v7) (pred_9 ?v2)
          (pred_3 ?v5 ?v11) (pred_4 ?v7 ?v2)
                   (pred_12 ?v11 ?v2) (pred_11 ?v5) 
                   (pred_5 ?v11) (pred_8 ?v7))
:effect (and  (pred_10 ?v11) (not (pred_5 ?v11))))


(:action op_5
:parameters (?v5 ?v6)
:precondition (and (pred_7 ?v5) (pred_7 ?v6)
               (pred_11 ?v5) (pred_3 ?v5 ?v6) (pred_10 ?v6))
:effect (and (pred_11 ?v6) (not (pred_11 ?v5))))

(:action op_4
:parameters (?v5 ?v7)
:precondition (and (pred_7 ?v5) (pred_6 ?v7) 
                  (pred_11 ?v5) (pred_1 ?v7 ?v5) (pred_2 ))
:effect (and (pred_8 ?v7)
   (not (pred_1 ?v7 ?v5)) (not (pred_2 ))))


(:action op_3
:parameters (?v5 ?v3 ?v8)
:precondition (and (pred_7 ?v5) (pred_6 ?v3) (pred_6 ?v8)
                  (pred_11 ?v5) (pred_8 ?v8) (pred_1 ?v3 ?v5))
:effect (and (pred_8 ?v3) (pred_1 ?v8 ?v5)
        (not (pred_8 ?v8)) (not (pred_1 ?v3 ?v5))))

(:action op_2
:parameters (?v5 ?v7)
:precondition (and (pred_7 ?v5) (pred_6 ?v7) 
                  (pred_11 ?v5) (pred_8 ?v7))
:effect (and (pred_2 ) (pred_1 ?v7 ?v5) (not (pred_8 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_13 obj_16 obj_07 obj_04 obj_12 obj_20 obj_01 obj_11 obj_05 obj_15 obj_09 obj_19 obj_18 obj_02 obj_03
    obj_06 obj_14
    obj_08 obj_17
    )

    (:init
       (pred_2)

       (pred_7 obj_10)
       (pred_7 obj_13)
       (pred_7 obj_16)
       (pred_7 obj_07)
       (pred_7 obj_04)
       (pred_7 obj_12)
       (pred_7 obj_20)
       (pred_7 obj_01)
       (pred_7 obj_11)
       (pred_7 obj_05)
       (pred_7 obj_15)
       (pred_7 obj_09)
       (pred_7 obj_19)
       (pred_7 obj_18)
       (pred_7 obj_02)
       (pred_7 obj_03)
       (pred_9 obj_06)
       (pred_9 obj_14)
       (pred_6 obj_08)
       (pred_6 obj_17)

       (pred_3 obj_10 obj_04)
       (pred_3 obj_10 obj_13)
       (pred_3 obj_13 obj_12)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_13 obj_10)
       (pred_3 obj_16 obj_20)
       (pred_3 obj_16 obj_07)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_07 obj_01)
       (pred_3 obj_07 obj_16)
       (pred_3 obj_04 obj_11)
       (pred_3 obj_04 obj_12)
       (pred_3 obj_04 obj_10)
       (pred_3 obj_12 obj_05)
       (pred_3 obj_12 obj_20)
       (pred_3 obj_12 obj_13)
       (pred_3 obj_12 obj_04)
       (pred_3 obj_20 obj_15)
       (pred_3 obj_20 obj_01)
       (pred_3 obj_20 obj_16)
       (pred_3 obj_20 obj_12)
       (pred_3 obj_01 obj_09)
       (pred_3 obj_01 obj_07)
       (pred_3 obj_01 obj_20)
       (pred_3 obj_11 obj_19)
       (pred_3 obj_11 obj_05)
       (pred_3 obj_11 obj_04)
       (pred_3 obj_05 obj_18)
       (pred_3 obj_05 obj_15)
       (pred_3 obj_05 obj_12)
       (pred_3 obj_05 obj_11)
       (pred_3 obj_15 obj_02)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_15 obj_20)
       (pred_3 obj_15 obj_05)
       (pred_3 obj_09 obj_03)
       (pred_3 obj_09 obj_01)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_19 obj_18)
       (pred_3 obj_19 obj_11)
       (pred_3 obj_18 obj_02)
       (pred_3 obj_18 obj_05)
       (pred_3 obj_18 obj_19)
       (pred_3 obj_02 obj_03)
       (pred_3 obj_02 obj_15)
       (pred_3 obj_02 obj_18)
       (pred_3 obj_03 obj_09)
       (pred_3 obj_03 obj_02)
       (pred_5 obj_20)
       (pred_5 obj_12)
       (pred_12  obj_20 obj_06)
       (pred_12  obj_12 obj_14)
       (pred_10 obj_10)
       (pred_10 obj_13)
       (pred_10 obj_16)
       (pred_10 obj_07)
       (pred_10 obj_04)
       (pred_10 obj_01)
       (pred_10 obj_11)
       (pred_10 obj_05)
       (pred_10 obj_15)
       (pred_10 obj_09)
       (pred_10 obj_19)
       (pred_10 obj_18)
       (pred_10 obj_02)
       (pred_10 obj_03)

       (pred_4  obj_08 obj_06)
       (pred_4  obj_17 obj_14)
       (pred_1 obj_08 obj_05)
       (pred_1 obj_17 obj_01)
       (pred_11 obj_07)
    )

    (:goal (and
       (pred_1 obj_17 obj_13)
    ))
(:constraints
  (always (not (pred_11 obj_16)))
)
)

; plan
1. (op_5 obj_07 obj_01)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_01)
   goals met: 0 of 1
2. (op_4 obj_01 obj_17)
   deleted: (pred_1 obj_17 obj_01) (pred_2)
   added: (pred_8 obj_17)
   goals met: 0 of 1
3. (op_5 obj_01 obj_09)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_09)
   goals met: 0 of 1
4. (op_5 obj_09 obj_15)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_15)
   goals met: 0 of 1
5. (op_5 obj_15 obj_05)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_05)
   goals met: 0 of 1
6. (op_1 obj_05 obj_12 obj_17 obj_14)
   deleted: (pred_5 obj_12)
   added: (pred_10 obj_12)
   goals met: 0 of 1
7. (op_5 obj_05 obj_12)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_12)
   goals met: 0 of 1
8. (op_5 obj_12 obj_13)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_13)
   goals met: 0 of 1
9. (op_2 obj_13 obj_17)
   deleted: (pred_8 obj_17)
   added: (pred_2) (pred_1 obj_17 obj_13)
   goals met: 1 of 1
